#include <bits/stdc++.h>

using namespace std;

/**
题目描述
元旦快到了，校学生会让乐乐负责新年晚会的纪念品发放工作。为使得参加晚会的同学所获得 的纪念品价值相对均衡，他要把购来的纪念品根据价格进行分组，但每组最多只能包括两件纪念品， 并且每组纪念品的价格之和不能超过一个给定的整数。为了保证在尽量短的时间内发完所有纪念品，乐乐希望分组的数目最少。

你的任务是写一个程序，找出所有分组方案中分组数最少的一种，输出最少的分组数目。

输入格式
共 n+2n+2 行：

第一行包括一个整数 ww，为每组纪念品价格之和的上上限。

第二行为一个整数 nn，表示购来的纪念品的总件数 GG。

第 3\sim n+23∼n+2 行每行包含一个正整数 P_iP
i
​
  表示所对应纪念品的价格。

输出格式
一个整数，即最少的分组数目。

输入输出样例
输入 #1复制
100
9
90
20
20
30
50
60
70
80
90
输出 #1复制
6
说明/提示
50\%50% 的数据满足：1\le n\le151≤n≤15。

100\%100% 的数据满足：1\le n\le3\times10^41≤n≤3×10
4
 ，80\le w\le20080≤w≤200，5 \le P_i \le w5≤P
i
​
 ≤w。
*/

const int MX = 3e4+ 10;
int a[MX];

int main() {
    //纪念品价格上限
    int w;
    scanf("%d", &w);

    //纪念品数量
    int n;
    scanf("%d", &n);

    for(int i = 1; i <= n; i++) {
        scanf("%d", &a[i]);
    }

    //排序
    sort(a + 1, a + 1 + n);

    int l = 1;
    int cnt = 0;
    while(l <= n) {
        if(a[n] + a[l] <= w) {
            l++;
            n--;
        } else {
            n--;
        }
        cnt++;
    }
    printf("%d", cnt);
    return 0;
}
